
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/4506064344)



<pre><code>Apply complete! Resources: 2 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/ce8d84a7-75f7-47d8-8258-e894675869f0/terraform-bin apply -auto-approve -no-color
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 1s [id=b3f1d32d9293aac54960813dd59a6ec89596b6c3]
data.aws_iam_role.role: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=check-liveness-after-site-deployment-trigger_user_scan]
data.aws_iam_policy_document.override: Reading...
aws_dynamodb_table.Register: Refreshing state... [id=check-liveness-after-site-deployment-Register]
aws_api_gateway_rest_api.api: Refreshing state... [id=bvx74jyh59]
aws_s3_bucket.images: Refreshing state... [id=check-liveness-after-site-deployment-djansang]
aws_dynamodb_table.Link_table: Refreshing state... [id=check-liveness-after-site-deployment-Link_table]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.override: Read complete after 0s [id=2500706472]
aws_dynamodb_table.Users: Refreshing state... [id=check-liveness-after-site-deployment-Users]
aws_s3_bucket.website: Refreshing state... [id=check-liveness-after-site-deployment-mtchoun-mouh.mongulu.cm]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.lambda: Refreshing state... [id=check-liveness-after-site-deployment-user_registration_consulcam]
aws_lambda_function.scan: Refreshing state... [id=check-liveness-after-site-deployment-scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=54i37r]
aws_api_gateway_method.method: Refreshing state... [id=agm-bvx74jyh59-54i37r-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-bvx74jyh59-54i37r-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=check-liveness-after-site-deployment-trigger_user_scan-lambda]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-bvx74jyh59-54i37r-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-bvx74jyh59-54i37r-OPTIONS-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-bvx74jyh59-54i37r-POST]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-bvx74jyh59-54i37r-POST-200]
aws_api_gateway_deployment.test: Refreshing state... [id=ytz79b]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-bvx74jyh59-54i37r-OPTIONS-200]
local_file.demo_page: Refreshing state... [id=81dbe611e41e3e7ad1cc7032e6365656c459ad0f]
local_file.index_page: Refreshing state... [id=ebbe333b859d616878c782737a8f00c424a24adc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "check-liveness-after-site-deployment-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "check-liveness-after-site-deployment-mtchoun-mouh.mongulu.cm"
      ~ policy                      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = "*" -> {
                          + "*" = "AWS"
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                        = {
            "Name"        = "Website"
            "environment" = "master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
              <head>
                <meta charset="UTF-8" />
                <meta name="viewport" content="width=device-width,initial-scale=1.0" />
                <meta name="description" content="Recevez une notification dès la sortie de votre passeport sans prise de tête :)"/>
                <script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"
                  integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"
                  crossorigin="anonymous"
                ></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js"
                  integrity="sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s"
                  crossorigin="anonymous"
                ></script>
                <link
                  rel="stylesheet"
                  href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"
                  integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z"
                  crossorigin="anonymous"
                />
                <link rel="stylesheet" href="style.css" />
                <title>Mtchoun' mouh</title>
                <!-- jQuery Modal -->
                <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js"></script>
                <link
                  rel="stylesheet"
                  href="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css"
                />
                <script type="text/javascript">
                  $(function () {
                    $("#help").popover({
                      trigger: "focus",
                    });
                  });
            
                  // disable onPaste
                  function disablePaste(e) {
                    return false;
                  }
                  // validate data
                  function controlFormData(e) {
                    e.preventDefault();
                    var Namere = /[A-Za-z]{1}[A-Za-z]/;
                    if (!Namere.test($("#name-input").val())) {
                      //alert("Name can not less than 2 char");
                      $("#errorMessage>p").html("Le nom ne peut avoir moins de 2 caractères!");
                      $("#errorMessage").modal("show");
                      return;
                    }
            
                    $("#confirmationModal").modal("show");
                  }
            
                  function submitToAPI(e) {
                    e.preventDefault();
                    var URL = "https://bvx74jyh59.execute-api.eu-central-1.amazonaws.com/check-liveness-after-site-deployment-dev/register";
            
                    var name = $("#name-input").val();
                    var data = {
                      name: name,
                    };
            
                    $.ajax({
                      type: "POST",
                      url: URL,
                      dataType: "json",
                      crossDomain: "true",
                      contentType: "application/json; charset=utf-8",
                      data: JSON.stringify(data),
            
                      success: function (response) {
                        // clear form and show a success message
                        $("#errorMessage>p").html(
                          "Nous avons  trouvé l <a href="+response["message"]+">image</a> d'où provient votre choix &#128578;"
            
                        );
                        $("#errorMessage").css("background", "#0f7555");
                        console.log("ok")
                        $("#errorMessage").modal("show");
                        document.getElementById("contact-form").reset();
                        //location.reload();
                      },
                      error: function () {
                        // show an error message
                        $("#errorMessage>p").html(
                          "Le nom rentré n'existe pas. \n Veuillez vérifier l'orthographe. "
                        );
                        $("#errorMessage").modal("show");
                        //location.reload();
                      },
                    });
                  }
                </script>
              </head>
              <body class="text-center">
                <!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/-->
                <form id="contact-form" method="post" class="form-signin">
                  <div class="mb-2">
                    <img alt="Logo cameroun" width="150" src="Armoiries_cameroun.svg" />
                  </div>
                  <h1 class="h5 font-weight-normal highlight">Si vous êtes là c'est que vous voulez une démonstration. Pas de soucis &#128578; </h1>
                  <h2 class="h6 font-weight-normal highlight">Nous vous proposons donc de choisir un nom au hasard dans le <b>communiqué du 22/09/2020</b>.
                      Pour cela rien de plus simple: rendez vous juste sur la page du <a href="https://www.consulacam-marseille.fr/index.php?p=consulat-cameroun-passeports">consulat</a>
                      et entrez ci-dessous celui-ci choisi.
                  </h2>
                  <b>NOTEZ BIEN </b>
                  <svg
                    data-html="true"
                    tabindex="0"
                    id="help"
                    data-toggle="popover"
                    data-trigger="focus"
                    title="Important !"
                    data-content="<p>Le nom doit être écrit pareil et dans le même ordre que celui choisi dans la page du consulat</p>
                                  <p>Liste des contraintes actuelles (vérifiez que vous n'entrez pas dans ces cas) qui ne sont pas supportés: </p>
                                  <ol>
                                    <li>Les noms comprenant le mot <b>vve</b></li>
                                    <li>Les noms comprenant les accents circonflexes comme Benoît</li>
                                    <li>Les noms comprenant les trémas comme Raïssa</li>
                                    <li>Les noms comprenant qu'un seul mot </li>
                                    <li>Les noms comprenant un mot se terminant par i comme Etoundi </li>
                                    <li>Les noms comprenant des chiffres romains</li>
                                  </ol>"
                    aria-hidden="true"
                    focusable="false"
                    data-prefix="fas"
                    data-icon="info-circle"
                    class="svg-inline--fa fa-info-circle fa-w-16"
                    role="img"
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 512 512"
                  >
                    <path
                      fill="currentColor"
                      d="M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z"
                    ></path>
                  </svg>
                  <label for="input-name" class="sr-only">Name:</label>
                  <input
                    type="text"
                    id="name-input"
                    placeholder="Veuillez le nom choisi …"
                    style="text-transform: uppercase"
                    class="form-control"
                  />
                  <div
                    class="g-recaptcha"
                    data-sitekey="6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys"
                  ></div>
            
                  <button
                    class="btn btn-lg btn-primary btn-block"
                    type="button"
                    onClick="submitToAPI(event)"
                  >
                    Submit
                  </button>
            
                  <h3 class="h6 mt-2 font-weight-normal">Retournez en <a href="index.html">page d'accueil </a> </h3>
            
                  <div class="mt-5">
                    <img alt="Logo cameroun" width="150" src="Armoiries_de_Marseille.svg" />
                  </div>
                  <p class="mt-3 mb-3 text-muted">&copy; 2020 - <a href="mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com">Contact</a></p>
                </form>
            
                <!-- Alert-error -->
                <div id="errorMessage" class="modal">
                  <p>Content error</p>
                </div>
              </body>
            </html>
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
              <head>
                <meta charset="UTF-8" />
                <meta name="viewport" content="width=device-width,initial-scale=1.0" />
                <meta name="description" content="Recevez une notification dès la sortie de votre passeport sans prise de tête :)"/>
                <script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"
                  integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"
                  crossorigin="anonymous"
                ></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js"
                  integrity="sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s"
                  crossorigin="anonymous"
                ></script>
                <link
                  rel="stylesheet"
                  href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"
                  integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z"
                  crossorigin="anonymous"
                />
                <link rel="stylesheet" href="style.css" />
                <!-- Matomo Tag Manager -->
                <script>
                var _mtm = window._mtm = window._mtm || [];
                _mtm.push({'mtm.startTime': (new Date().getTime()), 'event': 'mtm.Start'});
                var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
                g.async=true; g.src='https://matomo.mongulu.cm/js/container_mkXxNHkb.js'; s.parentNode.insertBefore(g,s);
                </script>
                <!-- End Matomo Tag Manager -->
                <title>Mtchoun' mouh</title>
                <!-- jQuery Modal -->
                <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js"></script>
                <link
                  rel="stylesheet"
                  href="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css"
                />
                <script type="text/javascript">
                  $(function () {
                    $("#help").popover({
                      trigger: "focus",
                    });
                  });
                  $(function () {
                    $("#help2").popover({
                      trigger: "focus",
                    });
                  });
                  // disable onPaste
                  function disablePaste(e) {
                    return false;
                  }
                  // validate data
                  function controlFormData(e) {
                    e.preventDefault();
                    var Namere = /[A-Za-z]{1}[A-Za-z]/;
                    if (!Namere.test($("#name-input").val())) {
                      //alert("Name can not less than 2 char");
                      $("#errorMessage>p").html("Le nom ne peut avoir moins de 2 caractères!");
                      $("#errorMessage").modal("show");
                      return;
                    }
                    if ($("#email-input").val() == "") {
                      $("#errorMessage>p").html("Veuillez entrer une adresse email valide!");
                      $("#errorMessage").modal("show");
                      return;
                    }
                    var reeamil = /^([\w-\.]+@([\w-]+\.)+[\w-]{2,6})?$/;
                    if (!reeamil.test($("#email-input").val())) {
                      $("#errorMessage>p").html("Veuillez entrer une adresse email valide!");
                      $("#errorMessage").modal("show");
                      return;
                    }
            
                    $("#confirmationName").val($("#name-input").val());
                    $("#confirmationEmail").val($("#email-input").val());
                    $("#confirmationModal").modal("show");
                  }
            
                  function submitToAPI(e) {
                    e.preventDefault();
                    var URL = "https://bvx74jyh59.execute-api.eu-central-1.amazonaws.com/check-liveness-after-site-deployment-dev/register";
            
                    if ($("#name-input").val() != $("#confirmationName").val()) {
                      $("#feedbackName").html("Votre nom ne correspond pas!");
                      $("#feedbackName").css("display", "block");
                      return;
                    }
                    if ($("#email-input").val() != $("#confirmationEmail").val()) {
                      $("#feedbackEmail").html("Votre adresse mail ne correspond pas!");
                      $("#feedbackEmail").css("display", "block");
                      return;
                    }
            
                    var name = $("#name-input").val();
                    var email = $("#email-input").val();
                    var data = {
                      name: name,
                      e

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                <input%0A                    type="text"%0A                    id="name-input"%0A                    placeholder="Veuillez le nom choisi …"%0A                    style="text-transform: uppercase"%0A                    class="form-control"%0A                  />%0A                  <div%0A                    class="g-recaptcha"%0A                    data-sitekey="6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys"%0A                  ></div>%0A            %0A                  <button%0A                    class="btn btn-lg btn-primary btn-block"%0A                    type="button"%0A                    onClick="submitToAPI(event)"%0A                  >%0A                    Submit%0A                  </button>%0A            %0A                  <h3 class="h6 mt-2 font-weight-normal">Retournez en <a href="index.html">page d'accueil </a> </h3>%0A            %0A                  <div class="mt-5">%0A                    <img alt="Logo cameroun" width="150" src="Armoiries_de_Marseille.svg" />%0A                  </div>%0A                  <p class="mt-3 mb-3 text-muted">&copy; 2020 - <a href="mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com">Contact</a></p>%0A                </form>%0A            %0A                <!-- Alert-error -->%0A                <div id="errorMessage" class="modal">%0A                  <p>Content error</p>%0A                </div>%0A              </body>%0A            </html>%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "../html/demo.html"%0A      + id                   = (known after apply)%0A    }%0A%0A  # local_file.index_page will be created%0A  + resource "local_file" "index_page" {%0A      + content              = <<-EOT%0A            <!DOCTYPE html>%0A            <html lang="en">%0A              <head>%0A                <meta charset="UTF-8" />%0A                <meta name="viewport" content="width=device-width,initial-scale=1.0" />%0A                <meta name="description" content="Recevez une notification dès la sortie de votre passeport sans prise de tête :)"/>%0A                <script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>%0A                <script%0A                  src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"%0A                  integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"%0A                  crossorigin="anonymous"%0A                ></script>%0A                <script%0A                  src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js"%0A                  integrity="sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s"%0A                  crossorigin="anonymous"%0A                ></script>%0A                <link%0A                  rel="stylesheet"%0A                  href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"%0A                  integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z"%0A                  crossorigin="anonymous"%0A                />%0A                <link rel="stylesheet" href="style.css" />%0A                <!-- Matomo Tag Manager -->%0A                <script>%0A                var _mtm = window._mtm = window._mtm || [];%0A                _mtm.push({'mtm.startTime': (new Date().getTime()), 'event': 'mtm.Start'});%0A                var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];%0A                g.async=true; g.src='https://matomo.mongulu.cm/js/container_mkXxNHkb.js'; s.parentNode.insertBefore(g,s);%0A                </script>%0A                <!-- End Matomo Tag Manager -->%0A                <title>Mtchoun' mouh</title>%0A                <!-- jQuery Modal -->%0A                <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js"></script>%0A                <link%0A                  rel="stylesheet"%0A                  href="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css"%0A                />%0A                <script type="text/javascript">%0A                  $(function () {%0A                    $("#help").popover({%0A                      trigger: "focus",%0A                    });%0A                  });%0A                  $(function () {%0A                    $("#help2").popover({%0A                      trigger: "focus",%0A                    });%0A                  });%0A                  // disable onPaste%0A                  function disablePaste(e) {%0A                    return false;%0A                  }%0A                  // validate data%0A                  function controlFormData(e) {%0A                    e.preventDefault();%0A                    var Namere = /[A-Za-z]{1}[A-Za-z]/;%0A                    if (!Namere.test($("#name-input").val())) {%0A                      //alert("Name can not less than 2 char");%0A                      $("#errorMessage>p").html("Le nom ne peut avoir moins de 2 caractères!");%0A                      $("#errorMessage").modal("show");%0A                      return;%0A                    }%0A                    if ($("#email-input").val() == "") {%0A                      $("#errorMessage>p").html("Veuillez entrer une adresse email valide!");%0A                      $("#errorMessage").modal("show");%0A                      return;%0A                    }%0A                    var reeamil = /^([\w-\.]+@([\w-]+\.)+[\w-]{2,6})?$/;%0A                    if (!reeamil.test($("#email-input").val())) {%0A                      $("#errorMessage>p").html("Veuillez entrer une adresse email valide!");%0A                      $("#errorMessage").modal("show");%0A                      return;%0A                    }%0A            %0A                    $("#confirmationName").val($("#name-input").val());%0A                    $("#confirmationEmail").val($("#email-input").val());%0A                    $("#confirmationModal").modal("show");%0A                  }%0A            %0A                  function submitToAPI(e) {%0A                    e.preventDefault();%0A                    var URL = "https://bvx74jyh59.execute-api.eu-central-1.amazonaws.com/check-liveness-after-site-deployment-dev/register";%0A            %0A                    if ($("#name-input").val() != $("#confirmationName").val()) {%0A                      $("#feedbackName").html("Votre nom ne correspond pas!");%0A                      $("#feedbackName").css("display", "block");%0A                      return;%0A                    }%0A                    if ($("#email-input").val() != $("#confirmationEmail").val()) {%0A                      $("#feedbackEmail").html("Votre adresse mail ne correspond pas!");%0A                      $("#feedbackEmail").css("display", "block");%0A                      return;%0A                    }%0A            %0A                    var name = $("#name-input").val();%0A                    var email = $("#email-input").val();%0A                    var data = {%0A                      name: name,%0A                      email: email,%0A                    };%0A            %0A                    $.ajax({%0A                      type: "POST",%0A                      url: URL,%0A                      dataType: "json",%0A                      crossDomain: "true",%0A                      contentType: "application/json; charset=utf-8",%0A                      data: JSON.stringify(data),%0A            %0A                      success: function () {%0A                        // clear form and show a success message%0A                        $("#errorMessage>p").html(%0A                          "Consultez votre email. Un lien de confirmation vous a été envoyé."%0A                        );%0A                        $("#errorMessage").css("background", "#0f7555");%0A                        $("#errorMessage").modal("show");%0A                        document.getElementById("contact-form").reset();%0A                        //location.reload();%0A                      },%0A                      error: function () {%0A                        // show an error message%0A                        $("#errorMessage>p").html(%0A                          "Nous n'avons malhreusement pas pu vous enregistrer. Veuillez contacter l'<a href=\"mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com\">administrateur </a>. "%0A                        );%0A                        $("#errorMessage").modal("show");%0A                        location.reload();%0A                      },%0A                    });%0A                  }%0A                </script>%0A              </head>%0A            %0A              <body class="text-center">%0A                <!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/-->%0A                <form id="contact-form" method="post" class="form-signin">%0A                  <div class="mb-2">%0A                    <img alt="Logo cameroun" width="150" src="Armoiries_cameroun.svg" />%0A                  </div>%0A                  <h1 class="h5 font-weight-normal highlight">Vous venez de déposer votre passeport au consulat de Marseille ?</h1>%0A                  <h2 class="h5 font-weight-normal highlight">On vous a dit regarder le site régulièrement et vous avez déjà trop de choses en tête &#128533;?</h2>%0A                  <h2 class="h6 font-weight-normal">Nous pouvons vous aider en vous notifiant dès sa sortie &#128526;.</h2>%0A                  <h3 class="h6 font-weight-normal">Pour cela rien de plus simple: Rentrez ici les informations requises*</h3>%0A                  <b>NOTEZ BIEN </b>%0A                  <svg%0A                    data-html="true"%0A                    tabindex="0"%0A                    id="help"%0A                    data-toggle="popover"%0A                    data-trigger="focus"%0A                    title="Important !"%0A                    data-content="<p>Le nom doit être écrit pareil et dans le même ordre que commnuniqué au consulat</p>%0A                                  <p>Liste des contraintes actuelles (vérifiez que vous n'entrez pas dans ces cas) qui ne sont pas supportés: </p>%0A                                  <ol>%0A                                    <li>Les noms comprenant le mot <b>vve</b></li>%0A                                    <li>Les noms comprenant les accents circonflexes comme Benoît</li>%0A                                    <li>Les noms comprenant les trémas comme Raïssa</li>%0A                                    <li>Les noms comprenant qu'un seul mot </li>%0A                                    <li>Les noms comprenant un mot se terminant par i comme Etoundi </li>%0A                                    <li>Les noms comprenant des chiffres romains</li>%0A                                  </ol>"%0A                    aria-hidden="true"%0A                    focusable="false"%0A                    data-prefix="fas"%0A                    data-icon="info-circle"%0A                    class="svg-inline--fa fa-info-circle fa-w-16"%0A                    role="img"%0A                    xmlns="http://www.w3.org/2000/svg"%0A                    viewBox="0 0 512 512"%0A                  >%0A                    <path%0A                      fill="currentColor"%0A                      d="M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z"%0A                    ></path>%0A                  </svg>%0A                  <label for="input-name" class="sr-only">Name:</label>%0A                  <input%0A                    type="text"%0A                    id="name-input"%0A                    placeholder="Veuillez entrer votre nom …"%0A                    style="text-transform: uppercase"%0A                    class="form-control"%0A                  />%0A                  <br />%0A                  <label for="inputEmail" class="sr-only">Email:</label>%0A                  <input%0A                    type="email"%0A                    id="email-input"%0A                    placeholder="Veuillez entrer votre adresse mail …"%0A                    class="form-control"%0A                  /><br />%0A                  <div%0A                    class="g-recaptcha"%0A                    data-sitekey="6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys"%0A                  ></div>%0A            %0A                  <!-- Link to open the modal -->%0A                  <a href="#confirmationButton" onClick="controlFormData(event)">%0A                    <button class="btn btn-lg btn-primary btn-block">Soumettre</button>%0A                  </a>%0A                  <b>* PROTECTION DES DONNEES </b>%0A                  <svg%0A                    data-html="true"%0A                    tabindex="1"%0A                    id="help2"%0A                    data-toggle="popover"%0A                    data-trigger="focus"%0A                    title="Important !"%0A                    data-content='<p> Nous nous engageons à protéger les informations personelles transmises: </p>%0A                                  <ol>%0A                                    <li>Celles-ci ne seront communiqués à aucun tiers et servent uniquement à vous envoyer votre notification</li>%0A                                    <li>Une fois la notification envoyé, vos informations sont immédiatement supprimés, nous ne les conservons pas</li>%0A                                  </ol>%0A                                  <p> Comme preuve de bonne foi, le <b>code source est disponible en libre accès <a href="https://github.com/mongulu-cm/mtchoun-mouh"> ici </a> </b>'%0A                    aria-hidden="true"%0A                    focusable="false"%0A                    data-prefix="fas"%0A                    data-icon="info-circle"%0A                    class="svg-inline--fa fa-info-circle fa-w-16"%0A                    role="img"%0A                    xmlns="http://www.w3.org/2000/svg"%0A                    viewBox="0 0 512 512"%0A                  >%0A                      <path%0A                        fill="currentColor"%0A                        d="M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z"%0A                      ></path>%0A                  </svg>%0A            %0A                  <h3 class="h6 font-weight-normal">Vous pouvez aussi faire notre <a href="demo.html">demo </a> avant de vous lancer.%0A                  </h3>%0A            %0A                  <div class="mt-5">%0A                    <img alt="Logo cameroun" width="150" src="Armoiries_de_Marseille.svg" />%0A                  </div>%0A                  <p class="mt-3 mb-3 text-muted">&copy; 2020 - <a href="mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com">Contact</a></p>%0A                </form>%0A            %0A                <!-- Modal HTML embedded directly into document -->%0A                <div id="confirmationModal" class="modal">%0A                  <h4%0A                    style="%0A                      width: 100%25;%0A                      heigth: 100px;%0A                      margin: 0px;%0A                      background-color: rgb(57, 66, 66);%0A                      color: whitesmoke;%0A                    "%0A                  >%0A                    Nous devons confirmer les informations précédentes.%0A                  </h4>%0A                  <div style="margin-top: 50px">%0A                    <div class="form-group row">%0A                      <label style="padding-left: 30px" for="input-name">Name:</label>%0A                      <input%0A                        type="text"%0A                        name="confirmationName"%0A                        class="form-control"%0A                        id="confirmationName"%0A                        onPaste="disablePaste(event)"%0A                        placeholder="Veuillez resaisir votre nom..."%0A                      />%0A                      <div id="feedbackName" class="valid-feedback">Looks good!</div>%0A                    </div>%0A                    <div class="form-group row">%0A                      <label style="padding-left: 30px" for="input-name">Email:</label>%0A                      <input%0A                        type="email"%0A                        name="confirmationEmail"%0A                        class="form-control"%0A                        id="confirmationEmail"%0A                        placeholder="Veuillez resaisir votre adresse mail..."%0A                      />%0A                    </div>%0A                    <div id="feedbackEmail" class="valid-feedback">Looks good!</div>%0A                  </div>%0A                  <a href="#"%0A                    ><button%0A                      class="col-4 btn btn-lg btn-warning"%0A                      onClick="submitToAPI(event)"%0A                    >%0A                      Confirm%0A                    </button>%0A                  </a>%0A                </div>%0A            %0A                <!-- Alert error -->%0A                <div id="errorMessage" class="modal">%0A                  <p>Content error</p>%0A                </div>%0A              </body>%0A            </html>%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "../html/index.html"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 2 to add, 2 to change, 0 to destroy.%0Alocal_file.index_page: Creating...%0Alocal_file.index_page: Creation complete after 0s [id=ebbe333b859d616878c782737a8f00c424a24adc]%0Alocal_file.demo_page: Creating...%0Alocal_file.demo_page: Creation complete after 0s [id=81dbe611e41e3e7ad1cc7032e6365656c459ad0f]%0Aaws_s3_bucket.images: Modifying... [id=check-liveness-after-site-deployment-djansang]%0Aaws_s3_bucket.website: Modifying... [id=check-liveness-after-site-deployment-mtchoun-mouh.mongulu.cm]%0Aaws_s3_bucket.images: Modifications complete after 7s [id=check-liveness-after-site-deployment-djansang]%0Aaws_s3_bucket.website: Modifications complete after 8s [id=check-liveness-after-site-deployment-mtchoun-mouh.mongulu.cm]%0A%0AApply complete! Resources: 2 added, 2 changed, 0 destroyed.%0A%0AOutputs:%0A%0Astage_url = "https://bvx74jyh59.execute-api.eu-central-1.amazonaws.com/check-liveness-after-site-deployment-dev"%0Awebsite_url = "http://check-liveness-after-site-deployment-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"%0A
::set-output name=stderr::
::set-output name=exitcode::0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":113,"Program":"tfcmt","SHA1":"c3fcd14c08a6de36760ddc2aeb3efa1afccc7fcd","Vars":{},"WorkflowName":"Deploy cases"} -->